Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: If your key or mouse button is not detectable by the Key History screen, one of the following might help:
pt_br: se sua tecla ou botão do mouse não for detectável pela tela do Histórico de Teclas, uma das seguintes soluções pode ajudar:

source: If your keyboard layout has AltGr instead of RAlt, you can probably use it as a hotkey prefix via <^>! as described here.
pt_br: Se o layout do seu teclado contém a tecla AltGr no lugar da RAlt, você provavelmente conseguirá usá-la como um prefixo de hotkey apondo o prefixo <^>!, conforme descrito aqui.

source: If your keyboard or mouse has a key not listed above, you might still be able to make it a hotkey by using the following steps:
pt_br: Se seu teclado ou mouse tem uma tecla não listada acima, você talvez ainda consiga criar uma hotkey com ela seguindo os passos a seguir:

source: In AutoHotkey v1, comparisons are performed numerically if both values are numeric even if both values are strings.
pt_br: Na versão 1 do AutoHotkey, comparações são feitas numericamente se ambos os valores são números mesmo que ambos sejam strings.

source: In AutoHotkey, statements include commands, assignments, function calls and other expressions.
pt_br: No AutoHotkey, instruções incluem comandos, atribuições de valor, chamadas de funções e outras expressões.

source: In AutoHotkey, variables are created simply by using them.
pt_br: No AutoHotkey, as variáveis são criadas no momento em que são simplesmente usadas.

source: In Explorer, right-click in empty space in the folder where you want to save the script, then select New and AutoHotkey Script.
pt_br: No Explorador de Arquivos, clique com o botão direito num espaço vazio da pasta onde você quer salvar o script, selecione Novo e AutoHotkey Script.

source: In Notepad (or a text editor of your choice), save a file with the .ahk filename extension.
pt_br: No Bloco de Notas (ou um editor de texto de sua escolha), salve um arquivo com a extensão .ahk.

source: In a method call such as those shown above, usually the object uses name or arg1 to identify which method should be called, and then only arg2 and beyond are passed to the method.
pt_br: mas não sempNuma chamada de método como as mostradas acima, normalmente o objeto usa name ou arg1 para identificar qual método deve ser chamado, e então arg2 e seguintes são passados ao método.

source: In addition, LControl & RAlt:: would make AltGr itself into a hotkey.
pt_br: Além disso, LControl & RAlt:: torna a própria tecla AltGr uma hotkey.

source: In addition, many of AutoHotkey's enhancements to the AutoIt v2 command set, as well as the Window Spy and the old script compiler, were adapted directly from the AutoIt v3 source code.
pt_br: Além do mais, muitas das melhorias do AutoHotkey sobre o conjunto de comandos do AutoIt v2, bem como o Espião de Janela e o velho compilador de scripts, foram adaptados diretamente a partir do código-fonte do AutoIt v3.

source: In addition, the above action occurs at the time the key is released.
pt_br: Além disso, a ação acima ocorre no momento em que a tecla é solta.

source: In addition, they buffer any physical keyboard or mouse activity during the send, which prevents the user's keystrokes from being interspersed with those being sent.
pt_br: Além disso, essas duas variantes do Send memorizam a atividade do teclado e mouse durante o envio, o que impede que as teclas pressionadas pelo usuário sejam indesejadamente intercaladas com aquelas enviadas pelos comandos SendInput e SendPlay.

source: In all other places, they are treated literally as if they were normal characters.
pt_br: Em todos os demais lugares, elas são tratadas literalmente como se fossem caracteres normais.

source: In effect, arg2 becomes the method's first apparent parameter.
pt_br: Com efeito, arg2 torna-se o primeiro parâmetro aparente do método.

source: In effect, a variable can contain both a string and a number simultaneously.
pt_br: Como efeito, a variável pode obter tanto uma string quanto um número simultaneamente.

source: In essence, functions and commands are the same thing, so the concepts explained here apply to both.
pt_br: Essencialmente, funções e comandos são a mesma coisa, então os conceitos aqui se aplicam a ambos.

source: In expression mode, variables do not need percent signs.
pt_br: No modo de expressão, as variáveis não precisam de sinais de porcentagem.

source: In fact, if the file is deleted immediately after use, it often does not actually get written to disk.
pt_br: De fato, se o arquivo for deletado imediatamente depois do uso, ele não costuma ser gravado no disco.

source: In most cases, AutoHotkey automatically converts between numeric strings and pure numbers as needed, and rarely differentiates between the two types.
pt_br: Na maioria dos casos, AutoHotkey converte automaticamente entre strings numéricas e números puros conforme necessário, e raramente diferencia entre os dois tipos.

source: In order to pass parameters to a COM object, the program must convert the variable's content to either a number or a string.
pt_br: Para passar parâmetros para um objeto COM, o programa deve converter o conteúdo da variável para ou uma número ou uma string.

source: In other words, Send a produces the letter "a" while Send {a} may or may not produce "a", depending on the keyboard layout.
pt_br: Em outras palavras Send a produz a letra “a” enquanto Send {a} pode ou não produzir “a”, dependendo do layout do teclado.

source: In other words, I want a certain key to act as it normally does except when a specific window is active.
pt_br: Em outras palavras, eu quero que determinada tecla funcione normalmente exceto quando uma janela específica está ativa.

source: In other words, SetFormat's slow mode prevents pure floats from being stored in variables.
pt_br: Em outras palavras, o modo lento do SetFormat impede que pontos flutuantes puros sejam armazenados em variáveis.

source: In other words, UTF-8 files which lack a byte order mark are misinterpreted, causing non-ASCII characters to be decoded incorrectly.
pt_br: Em outras palavras, os arquivos UTF-8 que não contêm uma BOM são interpretados erroneamente, causando a decodificação incorreta dos caracteres que não sejam ASCII.

source: In other words, a function call temporarily transfers control from the script to the function.
pt_br: Em outras palavras, uma chamada de função transfere temporariamente o controle do script para a função.

source: In other words, any code following the function call does not execute until after the function completes.
pt_br: Ou seja, qualquer código que vier depois da chamada de função não executará até que a função complete.

source: In other words, if the user has swapped the buttons via system settings, LButton:: is physically activated by clicking the right mouse button, but Send {LButton} performs the same as physically clicking the left button.
pt_br: Em outras palavras, se o usuário permutou os botões nas configurações do sistema, LButton:: é fisicamente ativada pelo clique do botão direito do mouse, mas Send {LButton} atua da mesma maneira de clicar fisicamente o botão esquerdo.

source: In other words, if the user has swapped the buttons via system settings, RButton:: is physically activated by clicking the left mouse button, but Send {RButton} performs the same as physically clicking the right button.
pt_br: Em outras palavras, se o usuário permutou os botões nas configurações do sistema, RButton:: é fisicamente ativada pelo clique do botão esquerdo do mouse, mas Send {RButton} atua da mesma maneira de clicar fisicamente o botão direito.

source: In other words, it inserts the values at the highest integer key plus one.
pt_br: Em outras palavras, ele insere os valores na maior chave inteira mais um.

source: In other words, pressing the hotkey once will start the Loop.
pt_br: Em outras palavras, pressionar a hotkey uma vez irá iniciar o Loop.

source: In other words, scripts are affected by the following limitations:
pt_br: Em outras palavras, scripts são afetados pelas limitações seguintes:

source: In other words, the value contained by the variable is copied into the variable which corresponds to the function's parameter.
pt_br: Ou seja, o valor contido na variável é copiado para a variável que corresponde ao parâmetro da função.

source: In our written instructions, we used indentation and numbering to group the statements.
pt_br: Em nossas instruções escritas, nós usamos indentação e numeração para agrupar as instruções.

source: In parameters that are input or output variables.
pt_br: Nos parâmetros que são variáveis de entrada ou de saída.

source: In parameters that are input or output variables:
pt_br: Em parâmetros que sejam variáveis de entrada ou de saída:

source: In particular, consider objects and ByRef parameters.
pt_br: Em particular, considere objetos e parâmetros ByRef.

source: In particular, device numbers are different and some components may be unavailable.
pt_br: Em particular, números de dispositivos são diferentes e alguns componentes podem não estar disponíveis.

source: In short, it is safest to stick to names consisting of ASCII letters (which are case insensitive), digits and underscore, and to avoid using names that start with a digit.
pt_br: Em resumo, é melhor manter nomes que consistam somente em letras ASCII (as quais não diferenciam maiúsculas e minúsculas), algarismos e underscores, e evitar usar nomes que comecem com um algarismo.

source: In short, you would probably want to choose UNICODE.
pt_br: Em resumo, você provavelmente quererá escolher UNICODE.

source: In short:
pt_br: Em resumo:

source: In silent install/uninstall mode, running scripts are closed automatically, where necessary.
pt_br: No modo de instalação/desinstalação silenciosa, os scripts que estiverem em execução são fechados automaticamente, quando necessário.

source: In some cases, software bundled with the mouse must instead be used to control this feature.
pt_br: Em alguns casos, o software que acompanha o mouse deve ser usado em vez do AutoHotkey para controlar essa funcionalidade.

source: In such cases, CapsLock is suppressed by the IME and cannot be detected by AutoHotkey.
pt_br: Nestes casos, o CapsLock é suprimido pelo IME e não pode ser detectado pelo AutoHotkey.

source: In the example below, you would hold down Numpad0 then press Numpad1 or Numpad2 to trigger one of the hotkeys:
pt_br: No exemplo abaixo, você segura a tecla Numpad0 e em seguida pressiona Numpad1 ou Numpad2 para desencadear uma das hotkeys:

source: In the example section of Edit you will find a script that allows you to change the default editor.
pt_br: Na seção de exemplos do termo Edit você encontrará um script que permite que você mude o editor padrão.

source: In the following code, both lines are run only if MyVar equals 5:
pt_br: No código a seguir, as duas linhas são executadas somente se MinhaVariavel é igual a 5:

source: In the following code, the message box is only shown if MyVar equals 5.
pt_br: No código a seguir, a caixa de mensagens só é mostrada se MinhaVariavel é igual a 5.

source: In the same way, control in a program or script usually flows from one statement to the next statement.
pt_br: Da mesma forma, o controle em um programa ou script normalmente segue de uma instrução para a próxima.

source: In this case, I used the simple expression "Color", which is (unsurprisingly) the key Color.
pt_br: Neste caso, eu usei a expressão simples "Cor", a qual é, como você esperava, a chave Cor.

source: In this example, the value "Yellow" is stored in the object key "Color".
pt_br: No exemplo acima, o valor "Amarelo" é armazenado na chave "Cor" do objeto.

source: In this example, the value "one" is stored in object key 1 (aka index 1), and the value 17 is stored in object key 4 (aka index 4).
pt_br: No exemplo posto, o valor “um” é armazenado na chave 1 do objeto (também conhecido como índice 1), e o valor 17 é armazenado na chave 4 do objeto (ou índice 4).

source: Increase SetKeyDelay.
pt_br: Aumente o valor de SetKeyDelay.

source: Increase the volume
pt_br: Aumentar o volume

source: Indentation
pt_br: Indentação

source: Indentation has no set style, but it's best to keep everything consistent.
pt_br: Não existe estilo estabelecido para indentar, mas é melhor deixar tudo coerente.

source: Indented:
pt_br: Indentado:

source: Index
pt_br: Índice

source: InputBox, OutputVar, Question 1, What is your first name?
pt_br: InputBox, OutputVar, Pergunta 1, Qual é seu primeiro nome?

source: InputBox, OutputVar2, Question 2, Do you like AutoHotkey?
pt_br: InputBox, OutputVar2, Pergunta 2, você gosta do AutoHotkey?

source: Insert (or Ins)
pt_br: Insert (ou Ins)

source: InsertAt method
pt_br: Método InsertAt

source: Install using command line options.
pt_br: Instalar usando as opções da linha de comando.

source: Installer Options
pt_br: Opções do instalador

source: Instead of asking for help on every little thing, sometimes spending some time alone (sometimes hours or days) and trying to get something to work will help you learn faster.
pt_br: Em vez de pedir ajuda para cada pequena coisa, às vezes gastar um tempo sozinho (pode chegar a horas ou dias) e tentar fazer algo funcionar vai ajudá-lo a aprender mais rápido.

source: Instead, an empty string (a string of zero length) often has this meaning.
pt_br: Em vez disso, uma string vazia (uma string com comprimento zero) é o que costuma fazer esse papel no AHK.

source: Instead, statements are grouped by enclosing them in braces, as shown above.
pt_br: Em vez de indentação, as instruções são agrupadas envolvendo-se-as em chaves, como mostrado acima.

source: Integers must be within the range -9223372036854775808 (-0x8000000000000000, or -263) to 9223372036854775807 (0x7FFFFFFFFFFFFFFF, or 263-1).
pt_br: Inteiros devem estar no intervalo 9223372036854775808 (-0x8000000000000000, ou -263) a 9223372036854775807 (0x7FFFFFFFFFFFFFFF, ou 263-1).

source: Interactive debugging
pt_br: Depuração interativa

source: Is it possible to turn it into a hotkey?
pt_br: É possível fazer dela uma hotkey?

source: Is it really a virus?
pt_br: Ele é mesmo um vírus?

source: It can even be used to open URLs such as https://www.autohotkey.com/ . If your computer is setup to run the type of program you want to run, it's very simple:
pt_br: O comando Run pode ser usado também para abrir URLs como https://www.autohotkey.com/ . Se seu computador está configurado para rodar o tipo de programa que você quer rodar, então é bem simples:

source: It has support for non-English letters and numbers (characters).
pt_br: Essa codificação tem suporte para letras e números de outras línguas além do inglês (caracteres).

source: It has the following effects:
pt_br: Ele tem os seguintes efeitos:

source: It is a key or key combination that the person at the keyboard presses to trigger some actions.
pt_br: É a tecla ou combinação de teclas que a pessoa diante do teclado pressiona para desencadear (executar) algumas ações.

source: It is best to avoid starting a name with a digit, as such names are confusing and will be considered invalid in AutoHotkey v2.
pt_br: É melhor evitar iniciar um nome de variável com um algarismo, já que esses nomes levam a confusões e serão considerados inválidos no AutoHotkey v2.

source: It is important to note that a variable and its value are not the same thing.
pt_br: É importante notar que a variável e seu valor não são a mesma coisa.

source: It is possible to tell that the key still exists by using the HasKey method, and it will still come up in a For loop.
pt_br: É possível saber que a chave ainda existe usando o método HasKey, e ainda assim ela será contada num Loop com For.

source: It is recommended that all new scripts retrieve environment variables such as Path via EnvGet:
pt_br: Recomenda-se que todos os novos scripts obtenham as variáveis de ambiente, como Path, via EnvGet.

source: It is unclear how this situation arises or whether it is normal, but experimenting with the joystick number in the joystick test script can help determine if this applies to your system.
pt_br: Não está claro o porquê de essa situação ocorrer nem se é normal, mas experimentar com o número do joystick no script de teste de joystick pode ajudar a determinar se isso se aplica ao seu sistema.

source: It is usually necessary for the script to initialise any variable which is expected to hold a number.
pt_br: Costuma ser necessário que o script inicialize qualquer variável cujo valor que se espera que ela armazene seja um número.

source: It literally stops code from going any further, to the lines below.
pt_br: Ela literalmente para o código, impedindo que ele prossiga na execução rumo às linhas abaixo.

source: It may also be necessary to repair the default registry values, either by reinstalling AutoHotkey or by running AutoHotkey Setup (from the Start menu) and selecting apply near the top of the window.
pt_br: Também pode ser necessário restaurar os valores padrão do registro, seja reinstalando o AutoHotkey ou executando seu setup (a partir do Menu Iniciar) e selecionando aplicar perto do topo da janela.

source: It may be helpful to think of a variable as just a name in that case.
pt_br: Pode ser útil pensar numa variável como simplesmente um nome, nesse caso.

source: It must end with a .ahk extension.
pt_br: Ele deve terminar com a extensão .ahk.

source: It's a good feeling, making something yourself without help.
pt_br: É uma sensação ótima conseguir fazer algo sem ajuda.

source: It's also possible with some rudimentary methods using Gui, but in a limited way.
pt_br: Também é possível desenhar por métodos rudimentares usando Gui, mas de forma limitada.

source: It's best you learn to indent ASAP.
pt_br: É melhor que você aprenda a indentar o quanto antes.

source: It's exactly the same as above, but I outdented the second line so we know it's separated from the if-statement:
pt_br: Já o caso a seguir é exatamente o mesmo do acima, mas eu diminuí o recuo da segunda linha de forma que agora ela está separada da instrução com if:

source: It's how AHK knows that {!} means "exclamation point" and not "press Alt".
pt_br: É assim que o AHK sabe que {!} significa “ponto de exclamação” e não “pressione Alt”.

source: It's important to remember that every one of these definitions all create the same thing (objects), just with different keys.
pt_br: É importante lembrar que cada uma das definições acima cria a mesma coisa — objetos — apenas com diferentes chaves.

source: It's simply spacing to break up your code so you can see what belongs to what.
pt_br: É simplesmente a prática de inserir espaços para dividir seu código de forma que você saiba o que pertence a quê.

source: It's usually not the same as F1.
pt_br: Normalmente não é a mesma de F1.

source: Items under the View menu control what the main window displays:
pt_br: itens sob o menu View controlam o que a janela principal exibe:

source: Just kidding.
pt_br: brincadeirinha.

source: Just like hotkeys, the Send command has special keys too.
pt_br: Da mesma forma que hotkeys, o comando Send também tem teclas especiais.

source: Keep going until you see an Install button.
pt_br: Prossiga até você ver um botão 'Install'.

source: Keep trying and failing until your code fails no more.
pt_br: Continue tentando e falhando até que seu código não falhe mais.

source: KeepWinZRunning := false
pt_br: ManterWinZRodando := false

source: KeepWinZRunning := true
pt_br: ManterWinZRodando := true

source: Key
pt_br: Tecla

source: Key history and script info - See KeyHistory.
pt_br: Histórico de teclas e informações do script - Veja KeyHistory.

source: Key name
pt_br: Nome da tecla

source: Keyboard
pt_br: Teclado

source: Keyboard and mouse:
pt_br: Teclado e mouse:

source: Keys
pt_br: Teclas

source: Keys and their mysterious symbols
pt_br: As teclas e seus misteriosos símbolos

source: LControl (or LCtrl)
pt_br: LControl (ou LCtrl)

source: Language Syntax
pt_br: Sintaxe da Linguagem

source: Large
pt_br: Grande

source: Later versions of the installer include a link in the bottom-right corner to extract setup files without installing.
pt_br: Versões posteriores do instalador incluem um link no canto inferior direito para extrair os arquivos de instalação sem instalar.

source: Launch Calculator
pt_br: Abre a Calculadora

source: Launch My Computer
pt_br: Abre Meu Computador

source: Launch default e-mail program
pt_br: Abre o programa padrão de e-mail

source: Launch default media player
pt_br: Abre o player de mídia padrão

source: Learn details about creating, editing and running a script, the tray icon, the main window, command line usage, portability and installer options.
pt_br: Aprenda detalhes sobre criação, edição e execução de um script, o ícone da bandeja, a janela principal, uso da linha de comando, portabilidade e opções do instalador.

source: Learn details about some general concepts and conventions used by AutoHotkey, with focus on explanation rather than code.
pt_br: Saiba detalhes sobre conceitos gerais e convenções usadas pelo AutoHotkey, num artigo focado mais na explicação do que no código.

source: Learn how to download and install AutoHotkey, to create a script, to use hotkeys and hotstrings, to send keystrokes, to run programs, etc.
pt_br: Aprenda a baixar e instalar o AutoHotkey, criar um script, usar teclas de atalho e hotstrings, enviar pressionamentos de teclas, executar programas e mais.

source: Learning takes time, the "pros" you encounter did not learn to be masters in just a few hours or days.
pt_br: Aprender leva tempo, os “prós” que você encontrar não dominaram a parada em apenas algumas horas ou dias.

source: Left Alt (technical info:
pt_br: Alt da esquerda (informações técnicas:

source: Left Alt.
pt_br: Tecla Alt da esquerda.

source: Left Ctrl (technical info:
pt_br: Ctrl da esquerda (informações técnicas:

source: Left Ctrl.
pt_br: Tecla Ctrl da esquerda.

source: Left Shift.
pt_br: Tecla Shift da esquerda.

source: Left Win.
pt_br: Tecla Win (botão do Windows) da esquerda.

source: Legacy mixed assignment
pt_br: Forma legada mista

source: Legacy text assignment
pt_br: Forma “legada” de atribuição de texto

source: Legacy variable assignment
pt_br: Forma “legada” de atribuição de variáveis

source: Light (default)
pt_br: Clara (padrão)

source: Line 1
pt_br: Linha 1

source: Line 2
pt_br: Linha 2

source: Lines most recently executed - See ListLines.
pt_br: Linhas executadas mais recentemente - Veja ListLines.

source: List of Keys (Keyboard, Mouse and Joystick) | AutoHotkey
pt_br: Lista de teclas (teclado, mouse e joystick) | AutoHotkey

source: List of Keys (Keyboard, Mouse and Joystick)
pt_br: Lista de teclas (teclado, mouse e joystick)

source: List of keys, mouse buttons and joystick controls
pt_br: Lista de teclas, botões do mouse e controles do joystick

source: Literal percent signs must be escaped by preceding them with an accent/backtick.
pt_br: Sinais de porcentagem literais devem ser escapados precedendo-os com um acento grave (backtick).

source: Loaded From
pt_br: Carregado a partir de

source: Look for AutoHotkey.chm or a file that says AutoHotkey and has a yellow question mark on it.
pt_br: Encontre o arquivo AutoHotkey.chm ou um arquivo em que esteja escrito “AutoHotkey” e tenha um ponto de interrogação amarelo.

source: Look for AutoHotkey.ahk in the following directories:
pt_br: Procure por AutoHotkey.ahk nos diretórios seguintes:

source: Lower the volume
pt_br: Diminuir o volume

source: Main Window
pt_br: Janela principal

source: Main resource (compiled script)
pt_br: Recurso principal (script compilado)
